old_files/SWMM_CFD/Case/OpenFOAM/overland/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



convertToMeters 1;



vertices
(
    (0 0   0) // 0
    (1430 0   0) // 1
    (1430 1490   0) // 2
    (0 1490   0) // 3
    (0 0   10) // 4
    (1430 0   10) // 5
    (1430 1490   10) // 6
    (0 1490   10) // 7
     (500 870   0) // 0
    (643 870   0) // 1
    (643 970   0) // 2
    (500 970   0) // 3
    (500 870   10) // 4
    (643 870   10) // 5
    (643 970   10) // 6
    (500 970   10) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (143 149 20) simpleGrading (1 1 1)
    //hex (8 9 10 11 12 13 14 15) (50 50 30) simpleGrading (1 1 1)
);
edges
(
);
defaultPatch
{
    name walls;
    type wall;
}
boundary
(

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
 
);

// ************************************************************************* //
