old_files/SWMM_CFD/Case/OpenFOAM/overland/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
   walls
    {
        type triSurfaceMesh;
        file "walls.stl";
    }
   
    inlet1
    {
        type            searchablePlate;
        origin          (517.5 867.5 6.5);
        span            (5 5 0);
      
    }

    inlet2
    {
        type            searchablePlate;
        origin          (947.5 852.5 2.5);
        span            (5 5 0);
    }

    inlet3
    {
        type            searchablePlate;
        origin          (1327.5 487.5 9);
        span            (5 5 0);
    }
};

castellatedMeshControls
{
    features
    (
        {
           file "walls.eMesh";
           level 1;
        }
   
    );

    refinementSurfaces
    {
       
        "inlet.*"
        {
            level (2 3);
            patchInfo
              {
                  type patch;
              }
        }
        walls
        {
            level (1 2);
            patchInfo
                {
                    type wall;
                }
        }
    }

    refinementRegions
    { 
        
    }
    locationInMesh (1110 865 8);
}

snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 2;

    // Maximum relative distance for points to be attracted by surface.
    // True distance is this factor times local maximum edge length.
    // Note: changed(corrected) w.r.t 17x! (17x used 2* tolerance)
    tolerance 3.0;

    // Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter 15;

        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap false;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        // Detect features between multiple surfaces
        // (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap false;
}

addLayersControls
{
    layers
    {
        "inlet.*"
        {                             
            nSurfaceLayers 10;
        }
        walls
        {
            nSurfaceLayers 5;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
}

writeFlags
(
);

mergeTolerance 1e-6;

// ************************************************************************* //
